In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("heights-zscore.csv")

In [5]:
df

      gender     height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [6]:
h=df["height"].mean() # to find the mean of the values from the column quantity
h

66.367559754866

In [7]:
x=df["height"].std()
x

3.847528120795573

In [8]:
df.describe()

             height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

In [9]:
df["z_score"] = (df.height - h)/x

In [10]:
df.head()

  gender     height   z_score
0   Male  73.847017  1.943964
1   Male  68.781904  0.627505
2   Male  74.110105  2.012343
3   Male  71.730978  1.393991
4   Male  69.881796  0.913375

In [11]:
df_without_outliers = df[ (df.z_score < 3) & (df.z_score > -3) ] # Dataset with outliers removed will be assinged here
df_without_outliers

      gender     height   z_score
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[9993 rows x 3 columns]

In [12]:
df_without_outliers.shape

(9993, 3)

In [13]:
df_without_outliers.describe()

            height      z_score
count  9993.000000  9993.000000
mean     66.363856    -0.000963
std       3.835511     0.996877
min      54.873728    -2.987329
25%      63.505894    -0.743767
50%      66.317755    -0.012945
75%      69.169353     0.728206
max      77.547186     2.905665